<template >
    <div class="con-h100">
        <div class="page1" v-if="show1" >
            <v-container class="con-h100 my-regular" >
                <v-row class="flex-column justify-space-between con-h100" >
                    <v-col class="text-center " >
                        <div >
                            <svg version="1.1" id="Слой_1" class='logorjd' xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                         viewBox="0 0 455 111.8" style="enable-background:new 0 0 455 111.8;" xml:space="preserve">
                    <g>
                        <g>
                            <path class="st0" d="M103.6,55.8c0-3.5-1.9-6-4.3-9.3l-3.4-4.7c-3.4-4.7-6.9-9.3-11.4-11.7c-4.6-2.3-10-2.3-17.4-2.3H9.7
                                c-2.3,0-5.1,0-7.4,2.3C0,32.4,0,35.4,0,37.7v4.1h13.7v70.1h27.4V41.8h26.8c2.9,0,6.6,0,8,3.2c1.4,3.2-0.6,6.2-2.3,8.5L51.3,83.8
                                h34.2l13.7-18.7C101.6,62,103.6,59.3,103.6,55.8z"/>
                            <path class="st0" d="M238,8.7C229.4,0,216.6,0,208,0h-23.7c-2.3,0-5.1,0-7.4,2.3c-2.3,2.3-2.3,5.2-2.3,7.6V14h34.3
                                c2.3,0,5.7,0,8,2.3c2.3,2.3,2.3,5.8,2.3,8.2v35c0,2.3,0,5.8-2.3,8.2c-2.3,2.3-5.7,2.3-8,2.3h-16.6c-2.9,0-6.6,0-8-3.2
                                c-1.4-3.2,0.6-6.1,2.3-8.5L208.9,28h-34.3l-13.7,18.7c-2.3,3.1-4.3,5.8-4.3,9.3c0,3.5,1.8,6,4.3,9.4l3.4,4.7
                                c3.4,4.7,6.8,9.3,11.4,11.7c4.6,2.3,10,2.3,17.4,2.3H208c8.5,0,21.4,0,30-8.7c8.6-8.8,8.6-21.6,8.6-26.3V35
                                C246.5,30.3,246.5,17.5,238,8.7z"/>
                            <polygon class="st0" points="133.5,27.8 92.4,83.8 126.7,83.8 167.8,27.8 		"/>
                        </g>
                        <g>
                            <path class="st1" d="M295,26.6c-11.7,0-18.7,2.3-26.2,7.4c-8.3,5.7-13,15.6-13,26.1c0,6.2,1.3,11.3,5.4,16.1
                                c5.9,6.9,15,8.9,22.8,8.9c10.5,0,12.5-1,18.2-2.4l2.6-0.6l2.9-15c-8.8,3.8-15,4.3-19.8,4.3c-8.4,0-11.5-2.7-12.2-8.1
                                c4.7-0.3,12.6-1.1,19.6-2.8c12.6-3.1,21.2-8.1,21.2-19.7C316.3,32.6,307.8,26.6,295,26.6z M290,49.3c-3.5,1.1-10.2,1.8-14.3,2.1
                                c2.6-7.9,9.3-12,14.7-12c5,0,5.8,2.4,5.8,3.9C296.2,46.2,294.1,48,290,49.3z"/>
                            <path class="st1" d="M350.5,1.2c-5.3,0-11,0.6-16.4,1.7c-3.2,0.7-5.6,3.4-5.9,6.6l-0.8,9.6c6.7-3.1,13.5-4.8,19-4.8
                                c12.8,0,16.9,9.7,16.9,18.9h-0.4c-2.7-3.5-8.6-5.4-14.2-5.4c-19.8,0-31.7,16.4-31.7,32c0,14.9,10,25.2,29.4,25.2
                                c30.4,0,37-24.9,37-45.2C383.4,15.4,373.4,1.2,350.5,1.2z M346.9,71.6c-4,0-9.9-3.4-9.9-11.6c0-8.8,4.7-18.6,14.9-18.6
                                c8.7,0,10.3,6.9,10.3,11.3C362.2,61.8,357.6,71.6,346.9,71.6z"/>
                            <path class="st1" d="M438,27.8l-0.8,3.5h-0.1c-5.3-3.3-12.4-4.8-18.4-4.8c-22.8,0-32.9,17.1-32.9,34.4c0,17.1,10.2,24.2,21.4,24.2
                                c5.4,0,12.6-0.6,19.7-8.5h0.2l-1.5,7.2H443l7.3-34.2l1.9-9.3c0.4-1.8,0.7-3.4,1.1-4.8l1.6-7.7H438z M429,60.4
                                c-3.3,6.1-9.1,9.9-13.9,9.9c-6.9,0-9.2-5.4-9.2-11.1c0-9.1,5.5-18.4,15.7-18.4c5.6,0,9.7,3,10.6,4.4L429,60.4z"/>
                        </g>
                    </g>
                </svg>

                        </div >
                        <div class="mt-2 my-bold" >
                            Путешествие<br >
                            это одно из лучших событий <br >
                            в жизни.
                        </div >
                    </v-col >
                    <v-col class="text-center ft d-flex flex-column align-center justify-center" >

                        <div class="white--text  px-4 text50m" >
                            Но путешествие - это не просто
                            перемещение из пункта А в пункт Б
                        </div >
                        <div class="text-center mt-6 botton-fix" >
                            <v-btn rounded class="red darken-1 white--text my-bold" @click="setshow2" >А что же ещё?
                            </v-btn >
                        </div >
                    </v-col >
                </v-row >
            </v-container >
        </div >
        <div class="page2" v-if="show2" >
            <v-container class="con-h100 my-regular" >
                <v-row class="flex-column justify-space-between con-h100" >
                    <v-col class="text-center " >
                        <div >
                            <svg version="1.1" id="Слой_1" class='logorjd' xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                         viewBox="0 0 455 111.8" style="enable-background:new 0 0 455 111.8;" xml:space="preserve">
                    <g>
                        <g>
                            <path class="st0" d="M103.6,55.8c0-3.5-1.9-6-4.3-9.3l-3.4-4.7c-3.4-4.7-6.9-9.3-11.4-11.7c-4.6-2.3-10-2.3-17.4-2.3H9.7
                                c-2.3,0-5.1,0-7.4,2.3C0,32.4,0,35.4,0,37.7v4.1h13.7v70.1h27.4V41.8h26.8c2.9,0,6.6,0,8,3.2c1.4,3.2-0.6,6.2-2.3,8.5L51.3,83.8
                                h34.2l13.7-18.7C101.6,62,103.6,59.3,103.6,55.8z"/>
                            <path class="st0" d="M238,8.7C229.4,0,216.6,0,208,0h-23.7c-2.3,0-5.1,0-7.4,2.3c-2.3,2.3-2.3,5.2-2.3,7.6V14h34.3
                                c2.3,0,5.7,0,8,2.3c2.3,2.3,2.3,5.8,2.3,8.2v35c0,2.3,0,5.8-2.3,8.2c-2.3,2.3-5.7,2.3-8,2.3h-16.6c-2.9,0-6.6,0-8-3.2
                                c-1.4-3.2,0.6-6.1,2.3-8.5L208.9,28h-34.3l-13.7,18.7c-2.3,3.1-4.3,5.8-4.3,9.3c0,3.5,1.8,6,4.3,9.4l3.4,4.7
                                c3.4,4.7,6.8,9.3,11.4,11.7c4.6,2.3,10,2.3,17.4,2.3H208c8.5,0,21.4,0,30-8.7c8.6-8.8,8.6-21.6,8.6-26.3V35
                                C246.5,30.3,246.5,17.5,238,8.7z"/>
                            <polygon class="st0" points="133.5,27.8 92.4,83.8 126.7,83.8 167.8,27.8 		"/>
                        </g>
                        <g>
                            <path class="st1" d="M295,26.6c-11.7,0-18.7,2.3-26.2,7.4c-8.3,5.7-13,15.6-13,26.1c0,6.2,1.3,11.3,5.4,16.1
                                c5.9,6.9,15,8.9,22.8,8.9c10.5,0,12.5-1,18.2-2.4l2.6-0.6l2.9-15c-8.8,3.8-15,4.3-19.8,4.3c-8.4,0-11.5-2.7-12.2-8.1
                                c4.7-0.3,12.6-1.1,19.6-2.8c12.6-3.1,21.2-8.1,21.2-19.7C316.3,32.6,307.8,26.6,295,26.6z M290,49.3c-3.5,1.1-10.2,1.8-14.3,2.1
                                c2.6-7.9,9.3-12,14.7-12c5,0,5.8,2.4,5.8,3.9C296.2,46.2,294.1,48,290,49.3z"/>
                            <path class="st1" d="M350.5,1.2c-5.3,0-11,0.6-16.4,1.7c-3.2,0.7-5.6,3.4-5.9,6.6l-0.8,9.6c6.7-3.1,13.5-4.8,19-4.8
                                c12.8,0,16.9,9.7,16.9,18.9h-0.4c-2.7-3.5-8.6-5.4-14.2-5.4c-19.8,0-31.7,16.4-31.7,32c0,14.9,10,25.2,29.4,25.2
                                c30.4,0,37-24.9,37-45.2C383.4,15.4,373.4,1.2,350.5,1.2z M346.9,71.6c-4,0-9.9-3.4-9.9-11.6c0-8.8,4.7-18.6,14.9-18.6
                                c8.7,0,10.3,6.9,10.3,11.3C362.2,61.8,357.6,71.6,346.9,71.6z"/>
                            <path class="st1" d="M438,27.8l-0.8,3.5h-0.1c-5.3-3.3-12.4-4.8-18.4-4.8c-22.8,0-32.9,17.1-32.9,34.4c0,17.1,10.2,24.2,21.4,24.2
                                c5.4,0,12.6-0.6,19.7-8.5h0.2l-1.5,7.2H443l7.3-34.2l1.9-9.3c0.4-1.8,0.7-3.4,1.1-4.8l1.6-7.7H438z M429,60.4
                                c-3.3,6.1-9.1,9.9-13.9,9.9c-6.9,0-9.2-5.4-9.2-11.1c0-9.1,5.5-18.4,15.7-18.4c5.6,0,9.7,3,10.6,4.4L429,60.4z"/>
                        </g>
                    </g>
                </svg>

                        </div >
                        <div class="mt-2 " >
                            Путешествие<br>
                            это знакомство с культурой<br>
                            тех мест, с которыми сталкиваешься<br>
                            <br>
                            Вам повезло!<br>
                            <br>
                            Потому что Россия это самая<br>
                            большая страна,<br>
                            объединяющая огромное<br>
                            количество культур<br>
                        </div >
                    </v-col >
                    <v-col class="text-center ft d-flex flex-column align-center justify-center" >


                        <div class="text-center mt-6 botton-fix" >
                            <v-btn rounded class="red darken-1 white--text my-bold" @click="setshow3" >Далее
                            </v-btn >
                        </div >
                    </v-col >
                </v-row >
            </v-container >
        </div >
        <div class="page3" v-if="show3" >
            <v-container class="con-h100 my-regular" >
                <v-row class="flex-column justify-space-between con-h100" >
                    <v-col class="text-center " >
                        <div >
                            <svg version="1.1" id="Слой_1" class='logorjd' xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                         viewBox="0 0 455 111.8" style="enable-background:new 0 0 455 111.8;" xml:space="preserve">
                    <g>
                        <g>
                            <path class="st0" d="M103.6,55.8c0-3.5-1.9-6-4.3-9.3l-3.4-4.7c-3.4-4.7-6.9-9.3-11.4-11.7c-4.6-2.3-10-2.3-17.4-2.3H9.7
                                c-2.3,0-5.1,0-7.4,2.3C0,32.4,0,35.4,0,37.7v4.1h13.7v70.1h27.4V41.8h26.8c2.9,0,6.6,0,8,3.2c1.4,3.2-0.6,6.2-2.3,8.5L51.3,83.8
                                h34.2l13.7-18.7C101.6,62,103.6,59.3,103.6,55.8z"/>
                            <path class="st0" d="M238,8.7C229.4,0,216.6,0,208,0h-23.7c-2.3,0-5.1,0-7.4,2.3c-2.3,2.3-2.3,5.2-2.3,7.6V14h34.3
                                c2.3,0,5.7,0,8,2.3c2.3,2.3,2.3,5.8,2.3,8.2v35c0,2.3,0,5.8-2.3,8.2c-2.3,2.3-5.7,2.3-8,2.3h-16.6c-2.9,0-6.6,0-8-3.2
                                c-1.4-3.2,0.6-6.1,2.3-8.5L208.9,28h-34.3l-13.7,18.7c-2.3,3.1-4.3,5.8-4.3,9.3c0,3.5,1.8,6,4.3,9.4l3.4,4.7
                                c3.4,4.7,6.8,9.3,11.4,11.7c4.6,2.3,10,2.3,17.4,2.3H208c8.5,0,21.4,0,30-8.7c8.6-8.8,8.6-21.6,8.6-26.3V35
                                C246.5,30.3,246.5,17.5,238,8.7z"/>
                            <polygon class="st0" points="133.5,27.8 92.4,83.8 126.7,83.8 167.8,27.8 		"/>
                        </g>
                        <g>
                            <path class="st1" d="M295,26.6c-11.7,0-18.7,2.3-26.2,7.4c-8.3,5.7-13,15.6-13,26.1c0,6.2,1.3,11.3,5.4,16.1
                                c5.9,6.9,15,8.9,22.8,8.9c10.5,0,12.5-1,18.2-2.4l2.6-0.6l2.9-15c-8.8,3.8-15,4.3-19.8,4.3c-8.4,0-11.5-2.7-12.2-8.1
                                c4.7-0.3,12.6-1.1,19.6-2.8c12.6-3.1,21.2-8.1,21.2-19.7C316.3,32.6,307.8,26.6,295,26.6z M290,49.3c-3.5,1.1-10.2,1.8-14.3,2.1
                                c2.6-7.9,9.3-12,14.7-12c5,0,5.8,2.4,5.8,3.9C296.2,46.2,294.1,48,290,49.3z"/>
                            <path class="st1" d="M350.5,1.2c-5.3,0-11,0.6-16.4,1.7c-3.2,0.7-5.6,3.4-5.9,6.6l-0.8,9.6c6.7-3.1,13.5-4.8,19-4.8
                                c12.8,0,16.9,9.7,16.9,18.9h-0.4c-2.7-3.5-8.6-5.4-14.2-5.4c-19.8,0-31.7,16.4-31.7,32c0,14.9,10,25.2,29.4,25.2
                                c30.4,0,37-24.9,37-45.2C383.4,15.4,373.4,1.2,350.5,1.2z M346.9,71.6c-4,0-9.9-3.4-9.9-11.6c0-8.8,4.7-18.6,14.9-18.6
                                c8.7,0,10.3,6.9,10.3,11.3C362.2,61.8,357.6,71.6,346.9,71.6z"/>
                            <path class="st1" d="M438,27.8l-0.8,3.5h-0.1c-5.3-3.3-12.4-4.8-18.4-4.8c-22.8,0-32.9,17.1-32.9,34.4c0,17.1,10.2,24.2,21.4,24.2
                                c5.4,0,12.6-0.6,19.7-8.5h0.2l-1.5,7.2H443l7.3-34.2l1.9-9.3c0.4-1.8,0.7-3.4,1.1-4.8l1.6-7.7H438z M429,60.4
                                c-3.3,6.1-9.1,9.9-13.9,9.9c-6.9,0-9.2-5.4-9.2-11.1c0-9.1,5.5-18.4,15.7-18.4c5.6,0,9.7,3,10.6,4.4L429,60.4z"/>
                        </g>
                    </g>
                </svg>

                        </div >
                        <div class="text3 " >
                            И теперь у вас как есть<br>
                            уникальная возможность<br>
                            превратить свою поездку с РЖД<br>
                            в увлекательное<br>
                            гастрономическое приключение!<br>
                        </div >
                    </v-col >
                    <v-col class="text-center ft d-flex flex-column align-center justify-center" >

                        <div class="text-center mt-6 botton-fix0" >
                            <v-btn rounded class=" darken-1 white--text my-bold" outlined @click="setshow3" >Хочу просто вкусно есть
                            </v-btn >
                        </div >
                        <div class="text-center mt-6 botton-fix" >
                            <v-btn rounded class="red darken-1 white--text my-bold" @click="setshow3" >Хочу вкусно есть и квест
                            </v-btn >
                        </div >
                    </v-col >
                </v-row >
            </v-container >
        </div >
    </div >

</template >

<script >
    export default {
        data: () => ({
            drawer: true,
            show1: true,
            show2: false,
            show3: false,
        }),
        methods: {
            setshow2() {
                this.show1 = false,
                    this.show2 = true

            },
            setshow3() {
                this.show2 = false,
                    this.show3 = true

            },
        }
    };
</script >

<style scoped >

    .st0 {
        fill: #D45A4C;
    }

    .st1 {
        fill: #FFFFFF;
    }

    .page1 {
        width: 100%;
        height: 100%;
        background-image: url('./../../../../assets/page1.jpg');
        background-size: cover;
        line-height: 20px;
    }
    .page2 {
        width: 100%;
        height: 100%;
        background-image: url('./../../../../assets/page2.jpg');
        background-size: cover;
        line-height: 20px;
    }
    .page3 {
        width: 100%;
        height: 100%;
        background-image: url('./../../../../assets/page3.jpg');
        background-size: cover;
        line-height: 20px;
    }

    .ft {

    }

    .logorjd {
        margin-top: 20px;
        width: 50%;
    }

    .con-h100 {
        height: 100%;
    }

    .text50m {
        margin-top: 100px;
    }
    .text3{
        margin-top: 70px;
    }

    @font-face {
        font-family: fsr;
        src: url(./../../../../assets/fonts/FSRAIL55.ttf);
    }

    @font-face {
        font-family: fsb;
        src: url(./../../../../assets/fonts/FSRAIL75.ttf);
    }

    .my-bold {
        font-family: fsb;
    }

    .my-regular {
        font-family: fsr;
    }
    .botton-fix0{
        position: fixed;
        bottom: 90px;
    }
    .botton-fix {
        position: fixed;
        bottom: 40px;
    }
</style >
